<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en-us">
<head>
  <link href="http://gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1">

  <title> New translations of High Performance MySQL &middot; Xaprb </title>

  
  <link rel="stylesheet" href="http://www.xaprb.com/css/poole.css">
  <link rel="stylesheet" href="http://www.xaprb.com/css/syntax.css">
  <link rel="stylesheet" href="http://www.xaprb.com/css/hyde.css">
  <link rel="stylesheet" href="http://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700|Abril+Fatface">

  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.ico">

  
  <link href="" rel="alternate" type="application/rss+xml" title="Xaprb" />
</head>

<body>

<div class="sidebar">
  <div class="container sidebar-sticky">
    <div class="sidebar-about">
      <h1>Xaprb</h1>
      <p class="lead">
		Stay Curious!
      </p>
    </div>

    <ul class="sidebar-nav">
      <li><a href="/">Home</a> </li>
      
        <li><a href="http://www.xaprb.com/about/"> About </a></li>
      
        <li><a href="http://www.xaprb.com/essential-books/"> Essential Books </a></li>
      
        <li><a href="http://www.xaprb.com/rx-toolkit/"> Regex Toolkit </a></li>
      
    </ul>

	 <p>
	 &copy; Baron Schwartz.
	 Contact: moc.brpax@norab, <a href="https://twitter.com/xaprb">Twitter</a>, <a href="https://linkedin.com/in/xaprb">LinkedIn</a>.
	 <br>Powered by <a href="http://hugo.spf13.com">Hugo</a>. <a href="/index.xml">RSS Feed</a></p>
						            
  </div>
</div>


    <div class="content container">
<div class="post">
  <h1>New translations of High Performance MySQL</h1>
  <span class="post-date">Sun, Mar 31, 2013 in
		
		<a href="/categories/Databases" class="btn btn-primary">Databases</a>
		
  </span>
      

<p><a href="http://www.highperfmysql.com/">High Performance MySQL, 3rd Edition</a> has been selling very well. It&rsquo;s translated into many languages. O&rsquo;Reilly sends me a hard-copy of the translations, and I have a whole section on my bookshelf dedicated to them. It&rsquo;s really satisfying to look at it.</p>

<p>Today I&rsquo;m happy to announce that we&rsquo;re moving forward with a new batch of translations. Demand has been so strong that we want to make the book accessible to as wide an audience as possible. Plus, I get a fat check every time O&rsquo;Reilly sells the translation rights.</p>

<p>The new languages will include Australian, l337 (&ldquo;Leet&rdquo;), Jive, Ebonics, Elmer Fudd, <a href="http://en.wikipedia.org/wiki/Blissymbols">Blissymbols</a>, and Esperanto. Here&rsquo;s a sample before-and-after paragraph:</p>

<blockquote>
<h3 id="toc_0">Isolating the Column</h3>

<p>We commonly see queries that defeat indexes or prevent MySQL from using the available indexes. MySQL generally can’t use indexes on columns unless the columns are isolated in the query. “Isolating” the column means it should not be part of an expression or be inside a function in the query.</p>
</blockquote>

<p>Here&rsquo;s the same passage, translated to Australian:</p>

<blockquote>
<p>&#729;&#654;&#633;&#477;nb &#477;&#613;&#647; u&#305; uo&#305;&#647;&#596;un&#607; &#592; &#477;p&#305;su&#305; &#477;q &#633;o uo&#305;ss&#477;&#633;dx&#477; u&#592; &#607;o &#647;&#633;&#592;d &#477;q &#647;ou plno&#613;s &#647;&#305; su&#592;&#477;&#623; u&#623;nlo&#596; &#477;&#613;&#647; ”&#387;u&#305;&#647;&#592;losI“ &#729;&#654;&#633;&#477;nb &#477;&#613;&#647; u&#305; p&#477;&#647;&#592;los&#305; &#477;&#633;&#592; su&#623;nlo&#596; &#477;&#613;&#647; ss&#477;lun su&#623;nlo&#596; uo s&#477;x&#477;pu&#305; &#477;sn &#647;’u&#592;&#596; &#654;ll&#592;&#633;&#477;u&#477;&#387; &#741;QS&#654;W &#729;s&#477;x&#477;pu&#305; &#477;lq&#592;l&#305;&#592;&#652;&#592; &#477;&#613;&#647; &#387;u&#305;sn &#623;o&#633;&#607; &#741;QS&#654;W &#647;u&#477;&#652;&#477;&#633;d &#633;o s&#477;x&#477;pu&#305; &#647;&#592;&#477;&#607;&#477;p &#647;&#592;&#613;&#647; s&#477;&#305;&#633;&#477;nb &#477;&#477;s &#654;luo&#623;&#623;o&#596; &#477;M</p>

<h3 id="toc_1">u&#623;nlo&#390; &#477;&#613;&#647; &#387;u&#305;&#647;&#592;losI</h3>
</blockquote>

<p>And here&rsquo;s the sample in <a href="http://www.youtube.com/watch?v=TVJPB3W54Tc">Jive</a>:</p>

<blockquote>
<h3 id="toc_2">Them Columns Cut a Lemon fo Isolatin&rsquo;</h3>

<p>Ain&rsquo;t nothin but a thang bout them messin&rsquo; up my old lady&rsquo;s indexes cain&rsquo;t be runnin&rsquo; upside down yo&rsquo; head. Slap my fro. MySQL can&rsquo;t dig it with lay no indexes on dem less&rsquo;n you gets &lsquo;em say I won say I pray I get the same ol&rsquo; same ol&rsquo;. Yo SQL, MySQL, all them SQL. What it is, Mama, what it is. Knock yoself a pro slick, get &lsquo;em spreshuns ain&rsquo;t be togetha. Use yo&rsquo; gray mattah! True dat, git it out wid de functions. Come on got to be! Sheeeeeeeh.</p>
</blockquote>

<p>There may be some rough edges, of course. This is only an early draft.</p>

<p>In addition, we are translating the technical examples and code samples into additional computer languages, including popular ones like LOLCATS, ALGOL (sorry, not the latest release &ndash; that will come soon), and even obscure languages like Node.JS and Commodore 64. We&rsquo;re also extending the book with compatibility plugins &ndash; sort of &ldquo;skins&rdquo; or &ldquo;personalities&rdquo; if you will &ndash; that will let you apply all the knowledge in the book to irrelevant, obscure database servers like Oracle, PostgreSQL (a.k.a. &ldquo;Postgre&rdquo;), Riak, and FAT32.</p>

<p>Your feedback and suggestions are welcome. Let me know if there&rsquo;s anything I can do to help make your High Performance MySQL experience more enjoyable. Or, if you prefer: <em>Slide your jib, brother sky, don&rsquo;t be sayin&rsquo; no off-time jive, lay it on, you dig? Mash me a fin.</em></p>

		                        <hr>
                        <h2>Comments</h2>
                        <div id="disqus_thread"></div>
                        <script type="text/javascript">
                            var disqus_shortname = 'xaprb';
                            (function() {
                                var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                                dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                                (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                            })();
                        </script>

</div>
</div>

  </body>
</html>
